[
  {
    "contract_type": "Service Agreement",
    "clause_heading": "Definitions",
    "contract_id": "0bba9359-b70c-48b0-ab96-d0369d214ab5",
    "clause_id": null,
    "clause": "Definitions, MDS agrees to provide services (“Services”) and ﬁnal work product (“Product”) as deﬁned in Exhibit A also referred to as “Statement(s) of Work” (or “SOWs”), attached to this Agreement."
  },
  {
    "contract_type": "Service Agreement",
    "clause_heading": "Intellectual Property",
    "contract_id": "0bba9359-b70c-48b0-ab96-d0369d214ab5",
    "clause_id": "1.1",
    "clause": "Intellectual Property, 1.1 Customer Content Materials: Customer represents and warrants to MDS that Customer owns the appropriate rights, title or interest in any Customer-provided materials or content (the “Customer Content”) and that Customer has the legal right to deliver and grant to MDS the right to use the Customer Content as speciﬁed in this Agreement. Customer hereby agrees to indemnify and hold harmless MDS from any and all third party claims, demands or causes of action alleging that MDS's possession or use of the Customer Content in accordance with the terms of this Agreement infringes on any rights of such third party in the Customer Content. This indemnity shall not extend to such modiﬁcations as may be made by MDS to the Customer Content or additions contributed to the Customer Content by MDS in the course of providing its Services to Customer under this Agreement. Title to the Customer Content shall remain with Customer."
  },
  {
    "contract_type": "Service Agreement",
    "clause_heading": "Intellectual Property",
    "contract_id": "0bba9359-b70c-48b0-ab96-d0369d214ab5",
    "clause_id": "1.2",
    "clause": "Intellectual Property, 1.2 Third Party Licenses: All software, graphics or other proprietary products owned by third parties necessary to perform the Services or to deliver the Product shall be speciﬁed in the SOWs. Unless otherwise speciﬁed herein or in the SOWs, MDS shall be responsible for negotiating and obtaining all necessary licenses from such third parties, and the cost thereof shall be treated as an out-of-pocket cost to be approved and reimbursed by the Customer. Should any project require the purchase of such items, if the purchase cost is either paid by the Customer or fully reimbursed to MDS, then the Customer shall own the items upon completion of the project."
  },
  {
    "contract_type": "Service Agreement",
    "clause_heading": "Intellectual Property",
    "contract_id": "0bba9359-b70c-48b0-ab96-d0369d214ab5",
    "clause_id": "1.3",
    "clause": "Intellectual Property, 1.3 MDS Materials: All trademarks, service marks, graphics, software, design, materials, products, website content, concepts, ideas, techniques and know-how (including, but not limited to, computer software, code or other proprietary products owned or developed by MDS prior to the entering into of this Agreement shall be and shall remain the property of MDS. To the extent necessary to run, demonstrate or use the Services, MDS shall provide to Customer a perpetual, non-exclusive license at no additional cost or fee to be granted after Customer has made payment for all undisputed outstanding invoices. MDS shall have the right to terminate the license granted hereunder upon written notice to Customer if Customer fails to comply with the terms and conditions of this Agreement, including, but not limited to, failure to pay for the Services rendered."
  },
  {
    "contract_type": "Service Agreement",
    "clause_heading": "Intellectual Property",
    "contract_id": "0bba9359-b70c-48b0-ab96-d0369d214ab5",
    "clause_id": "1.4",
    "clause": "Intellectual Property, 1.4 Custom Deliverables: All trademarks, service marks, graphics, design, materials, products or web site content that are speciﬁed in the SOWs to be custom developed by MDS speciﬁcally for the Customer as part of the Services or the Product (the “Custom Deliverables”), shall be the property of Customer, and all title and interest therein shall vest in the Customer, after Customer has made full payment for any and all undisputed outstanding invoices related to the Custom Deliverables. Custom Deliverables shall not include work product, software routines, database processes or compilations or web site routines developed by MDS which are of a general or generic nature and are used or usable by MDS in other applications where Customer Content is not used and the rights of the Customer in the Custom Deliverables are not compromised. MDS will assign, after payment in full of all undisputed outstanding invoices owed by Customer, any and all rights, title and interest, including, but not limited to, patents, copyrights, trade secrets and other proprietary rights to the Custom Deliverables developed in connection with the performance of this Agreement to Customer. If requested, MDS shall execute and deliver any additional documents or instruments to give effect to such assignment of rights described in this section. In the event that Customer fails to pay all outstanding and undisputed invoices within a period of 90 days from original due date, then MDS will have the right to reuse and resell any work product. This will not relieve Customer of its obligation to pay any and all outstanding amounts owed. If Customer retires all amounts owed, then MDS will deliver any deliverables still outstanding."
  },
  {
    "contract_type": "Service Agreement",
    "clause_heading": "Intellectual Property",
    "contract_id": "0bba9359-b70c-48b0-ab96-d0369d214ab5",
    "clause_id": "1.5",
    "clause": "Intellectual Property, 1.5 Further Assurances: MDS warrants and represents that it will, at the time of delivery, have the right to transfer ownership to the Customer of the Custom Deliverables. MDS agrees to indemnify and hold harmless Customer from and against any third party claims, demands or causes of action alleging that Customer’s possession or use of the Custom Deliverables in accordance with the terms of this Agreement infringes any copyright or trademark rights of such third party in the Custom Deliverables. This indemnity shall not extend to such modiﬁcations as may be made to the Custom Deliverables by Customer, or any party other than MDS, unless MDS authorizes such modiﬁcations in advance and in writing."
  },
  {
    "contract_type": "Service Agreement",
    "clause_heading": "Intellectual Property",
    "contract_id": "0bba9359-b70c-48b0-ab96-d0369d214ab5",
    "clause_id": "1.6",
    "clause": "Intellectual Property, 1.6 No Infringement: Each party hereto represents and warrants that it will not knowingly or intentionally infringe upon any patents, copyrights, or other intellectual property rights of any third party, nor has any claim (whether or not embodied in an action, past or present) of such infringement been threatened or asserted, nor is such a claim pending against either party."
  },
  {
    "contract_type": "Service Agreement",
    "clause_heading": "Intellectual Property",
    "contract_id": "0bba9359-b70c-48b0-ab96-d0369d214ab5",
    "clause_id": "1.7",
    "clause": "Intellectual Property, 1.7 Rights retained: Each party shall retain all right, title and interest in and to its respective trademarks, trade names, service marks, logos, copyrights and other intellectual property (the “Marks”). Neither party shall use the Marks of the other party in any way, including without limitation, for marketing or promotional purposes, without prior written approval of the other party. However, MDS may showcase Products in presentations, case studies, or proposals, may reference the services provided for Customer, and place attribution language on any website designed for Customer without violating this section. The parties will also work together to issue a joint press release, where appropriate."
  },
  {
    "contract_type": "Service Agreement",
    "clause_heading": "Warranty",
    "contract_id": "0bba9359-b70c-48b0-ab96-d0369d214ab5",
    "clause_id": "2",
    "clause": "Warranty, MDS warrants the Services and Product (including the Custom Deliverables, if any) to be free and clear of defects in material and workmanship for a period of ninety (90) days from the date of delivery of the Services and Product to Customer. Any defects found within such ninety (90) day period shall be reported to MDS in writing and MDS shall use its best efforts to cure such defect in a timely manner. This warranty does not apply if the Product is modiﬁed by any person other than MDS, nor to problems caused by defects or failures of hardware or software not provided by MDS, nor to defects caused by negligence of Customer or any other person except MDS. There are no other representations or warranties, express or implied, written or oral, made by MDS with respect to the Product."
  },
  {
    "contract_type": "Service Agreement",
    "clause_heading": "Damages",
    "contract_id": "0bba9359-b70c-48b0-ab96-d0369d214ab5",
    "clause_id": "3",
    "clause": "Damages, Neither party shall be obligated or responsible to the other for any special, indirect, incidental, consequential, punitive or exemplary damages arising hereunder, even if advised of the possibility thereof. The rights and remedies, including indemnification, speciﬁed in this Agreement constitute the parties’ sole rights and remedies. In no event shall the total liability of MDS to Customer under this Agreement exceed the total fees to be paid to MDS by Customer under this Agreement."
  },
  {
    "contract_type": "Service Agreement",
    "clause_heading": "Non-Solicitation",
    "contract_id": "0bba9359-b70c-48b0-ab96-d0369d214ab5",
    "clause_id": "4",
    "clause": "Non-Solicitation, Both parties agree that, neither party shall solicit or hire any employee or contractor of the other party as an employee, consultant, partner, business associate or in any indirect capacity, except with prior written consent."
  },
  {
    "contract_type": "Service Agreement",
    "clause_heading": "Assignment",
    "contract_id": "0bba9359-b70c-48b0-ab96-d0369d214ab5",
    "clause_id": "5",
    "clause": "Assignment, No party shall assign, transfer or otherwise dispose of its rights or obligations under this Agreement, in whole or in part, without the prior written consent of the other parties, which consent shall not be unreasonably withheld. MDS may subcontract with third parties but such action shall not relieve MDS of any of its obligations hereunder."
  },
  {
    "contract_type": "Service Agreement",
    "clause_heading": "Choice of Law",
    "contract_id": "0bba9359-b70c-48b0-ab96-d0369d214ab5",
    "clause_id": "6",
    "clause": "Choice of Law, This Agreement shall be governed by and construed in accordance with the laws of the State of Georgia in the United States without reference to its conflicts of laws. Each party submits to the exclusive jurisdiction of the courts of Clarke County, Georgia and expressly waives any and all rights to bring any action in or before any other court. Each of the parties expressly waives any and all objections such party may have to venue, including, without limitation, the inconvenience of such forum, in any of such courts."
  },
  {
    "contract_type": "Service Agreement",
    "clause_heading": "Dispute Resolution",
    "contract_id": "0bba9359-b70c-48b0-ab96-d0369d214ab5",
    "clause_id": "7",
    "clause": "Dispute Resolution, In the event that at any time during the term of this Agreement a disagreement, dispute, controversy or a claim should arise out of, or relating to, the interpretation or performance under this Agreement or the breach or invalidity thereof, the parties will attempt in good faith to resolve their differences. If the parties are unable to resolve their differences, any dispute which is not resolved shall be referred to the court(s) listed above. Each party shall pay the fees of its respective attorneys, the expenses of its witnesses and any other expenses connected with presenting its claim. Notwithstanding the foregoing, either party shall be entitled to elect to seek injunctive or other equitable relief in a court of proper jurisdiction to enforce its Intellectual Property rights. (1) The provisions contained in this Article 7. shall survive the termination and/or expiration of this Agreement. (2) Intellectual Property Matters. Notwithstanding anything to the contrary contained herein, all issues related to Intellectual Property Rights hereunder shall be settled in a court of competent jurisdiction."
  },
  {
    "contract_type": "Service Agreement",
    "clause_heading": "Confidentiality",
    "contract_id": "0bba9359-b70c-48b0-ab96-d0369d214ab5",
    "clause_id": "8",
    "clause": "Confidentiality, Each party proposes to disclose certain trade secrets, conﬁdential and proprietary information (the \"Conﬁdential Information\") to the other party. Conﬁdential Information shall include all data, materials, client lists and names, products, development practices, technology, computer programs, speciﬁcations, manuals, business plans, software, marketing plans, business plans, employee information, ﬁnancial information, and other information that a reasonable person working within the industry would deem sensitive, proprietary, or conﬁdential in nature that is disclosed or submitted, orally, in writing, or by any other media, by one party to the other. Nothing herein shall require either party to disclose any of its information except as may be required to complete the project or Services covered under this Agreement. Each party agrees that the Conﬁdential Information is to be considered conﬁdential and proprietary to the party receiving such Conﬁdential Information and that party shall hold the same in conﬁdence, shall not use the Conﬁdential Information other than for the purposes of this Agreement, and shall disclose it only to its ofﬁcers, directors, or employees with a speciﬁc need to know. Neither party will disclose, publish or otherwise reveal any of the Conﬁdential Information received from the other to any third party whatsoever except with the speciﬁc prior written authorization of the party owning such Conﬁdential Information."
  },
  {
    "contract_type": "Service Agreement",
    "clause_heading": "Time is of the Essence",
    "contract_id": "0bba9359-b70c-48b0-ab96-d0369d214ab5",
    "clause_id": "9",
    "clause": "Time is of the Essence, Time is of the essence of this Agreement. Failure of the Customer to meet delivery deadlines set forth on the project timeline for Customer Content or for interim phase approval will cause all other speciﬁed dates and deadlines on the project timeline to be pushed back or adjusted by an equivalent number of days. If any delay in performance is due to default of MDS, Customer’s payment obligation shall be suspended for such time as MDS shall fail to meet a milestone completion date under the project timeline in the Statement of Work. Customer’s payment obligation shall not resume until such time as MDS has cured this default. Customer shall notify MDS by e-mail or other writing of any suspension in payment, and MDS shall have ten (10) business days to cure any such default and to comply with the project timeline. If such default by MDS continues for an additional ﬁfteen (15) days after notice by Customer and MDS has not commenced cure or provided Customer written explanation of good cause why such default cannot be timely cured, Customer shall have the right, ﬁfteen (15) days after notice to MDS and failure to cure by MDS, to terminate this Agreement and hire another vendor for development of the Product. In this event, MDS will provide all materials and consultation, at MDS’s expense, to facilitate a smooth transition (including, without limitation, provision of all Product produced through the termination date and consultancy for such transition) to such vendor, which shall be completed within 15 days after termination. In the event of such termination, Customer shall only pay MDS for out of pocket expenses and for work successfully performed but not paid for since the last successfully completed milestone."
  },
  {
    "contract_type": "Service Agreement",
    "clause_heading": "Customer Response Times",
    "contract_id": "0bba9359-b70c-48b0-ab96-d0369d214ab5",
    "clause_id": "10",
    "clause": "Customer Response Times, MDS has based its timelines and cost estimates on feedback times from the Customer. If these are not met, signiﬁcant impact on both the project timelines and costs could occur. Unless otherwise agreed in writing (e.g. in an applicable SOW), Customer shall have a 5-business day window to provide verbal and/or written feedback on any interim phase materials delivered by MDS for review and comment, unless speciﬁed otherwise in the SOWs. After the 5-day window, all deliverables will be considered accepted unless written notice of deﬁciency has been presented to MDS. If Customer has not provided written feedback during the review window, MDS may suspend all work on the project and notify Customer via email that the period for feedback has elapsed and any project deadlines or milestones affected by the delay will be extended by the number of days of the delay. If ﬁve (5) working days have elapsed without feedback from Customer, MDS may re-assign its personnel and project resources to other projects and MDS may take up to ten (10) working days to re-build the project team after Customer provides feedback. The restructured team may or may not be composed of the members of the original team. If a project is put “on hold” at the Customer’s request for ﬁfteen (15) working days or more, MDS may invoice Customer for all work performed up to that point. Customer agrees to notify MDS as soon as possible when the project is to be re-started so that a project team may be assembled. This may take up to ﬁfteen (15) working days depending on MDS’s workload. Projects may not be put on hold for more than thirty (30) days. On the 31st day, the project will be deemed terminated for the convenience of the Customer and MDS will invoice Customer for the projected work and deliverables through the effective date of termination (or the 31st day whichever is later) as set forth in the project plan or in the project charter document. This invoice will be due and payable upon receipt."
  },
  {
    "contract_type": "Service Agreement",
    "clause_heading": "Force Majeure",
    "contract_id": "0bba9359-b70c-48b0-ab96-d0369d214ab5",
    "clause_id": "11",
    "clause": "Force Majeure, Neither party shall be liable to the other, nor shall any remedy be extended, for any failure of performance due to causes beyond that party’s reasonable control, including but not limited to: acts of God, ﬁre, explosion, lightening, flood, earthquake, tornado, storms, meteorological, hydrological or geological conditions or other catastrophes caused thereby; any law, order, regulation, direction, action, or request of any governmental or regulatory entity or agency, or any civil or military authority; emergencies; civil unrest, insurrections, riots, wars; unavailability of rights​of​way, third party services or materials; or strikes, lock​outs, work stoppages, labor shortages or other labor difﬁculties; or transmission failures, telecommunication line breaks or outages, or failure of the Internet provided that the delayed party: (a) gives the other party prompt notice of such cause, and (b), uses its reasonable commercial efforts to correct promptly such failure or delay in performance."
  },
  {
    "contract_type": "Service Agreement",
    "clause_heading": "Notices",
    "contract_id": "0bba9359-b70c-48b0-ab96-d0369d214ab5",
    "clause_id": "12",
    "clause": "Notices, All notices required to be given under the terms of this Agreement shall be in writing and may be effected by delivering the same or mailing the same by pre-paid registered mail or sending the same by facsimile. Such notice shall be deemed to have been given on the day on which it was delivered, or if mailed, on the 5th business day following the date on which it was mailed, or if sent by facsimile, on the next business day following the day on which was sent."
  },
  {
    "contract_type": "Service Agreement",
    "clause_heading": "Legal Fees",
    "contract_id": "0bba9359-b70c-48b0-ab96-d0369d214ab5",
    "clause_id": "13",
    "clause": "Legal Fees, In the event either party may require the services of an attorney in order to enforce any of their rights hereunder, the defaulting or breaching party shall, without limitation, be liable to the non-defaulting or non-breaching party for such party’s reasonable attorney fees."
  },
  {
    "contract_type": "Service Agreement",
    "clause_heading": "Payment Terms",
    "contract_id": "0bba9359-b70c-48b0-ab96-d0369d214ab5",
    "clause_id": "14",
    "clause": "Payment Terms, Amounts due to MDS shall be due and payable in full as speciﬁed in the SOWs. All fees, costs, or expenses for ﬁxed-price projects shall be due and payable in full pursuant to the terms set forth in the applicable SOW. Invoices will be submitted electronically to the following Customer email address: Bob Loblaw – bob@acme.com Invoices will be due net 14 days after issued. Any amounts not paid within the time speciﬁed shall be subject to ﬁnance charges at the maximum amount permitted by law. Customer will pay all costs of collection including ﬁnance charges, court costs, plus 15% of such sum as attorney fees if collected by law or by an attorney of law. All deadlines for performance by MDS will be extended by at least the number of days of delay in any payment by Customer. MDS reserves the right to delay or suspend the Services in the event fees are not timely paid in full when due. Customer’s obligation to pay for Services constitutes an independent duty, and as such, Customer agrees not to make any set-offs against amounts owed to MDS. Payment not received within the terms stated on the invoice, SOW or Change Order (“CO, COs”), shall be subject to ﬁnance charges. Invoices will be rendered on a monthly or periodic basis and are due as stated in the SOW(s). If payments are not received promptly, MDS reserves the right to stop work on all active projects until Customer’s accounts are brought current. In the event that Customer: a) ceases to do business in the normal course, becomes or is declared insolvent or bankrupt, is the subject of any proceeding relating to liquidation or insolvency that is not dismissed within sixty (60) days, or makes an assignment for the beneﬁt of its creditors; or b) MDS reasonably determines that Customer’s ﬁnancial condition is of such a nature that Customer may not be capable of meeting its obligations under this Agreement, then MDS shall have the right to demand and receive immediate payment in full of any undisputed outstanding invoice (as any ﬁrst position secured creditor), expect payment in advance for any future work to be performed by MDS under this Agreement, and/or terminate this Agreement."
  },
  {
    "contract_type": "Service Agreement",
    "clause_heading": "Approvals and Change Orders",
    "contract_id": "0bba9359-b70c-48b0-ab96-d0369d214ab5",
    "clause_id": "15",
    "clause": "Approvals and Change Orders, MDS’s design process is iterative, in discrete phases, such that design of subsequent work product requires building upon prior, approved work product. Each work phase requires sign-off by the Customer’s designated point of contact (“Customer Project Manager”). Changes to design or development effort in earlier phases made after sign-off may affect the project scope and/or timeline and result in additional charges. MDS reserves the right to deliver COs and assess supplemental charges in the event of changes in earlier phases after sign-off. MDS also reserves the right to change the project timeline and renegotiate Service and Product fees in the event of changes in earlier phases after sign-off. Unless otherwise stated, all sign-offs and direction must come directly from Customer’s Project Manager."
  },
  {
    "contract_type": "Service Agreement",
    "clause_heading": "Term",
    "contract_id": "0bba9359-b70c-48b0-ab96-d0369d214ab5",
    "clause_id": "16",
    "clause": "Term, This Agreement shall continue until either party provides the other party with written notiﬁcation of termination at least thirty (30) days prior notice. On the effective date of termination, which is at least thirty (30) days from the receipt of notice, MDS will invoice Customer for all work and deliverables projected by the project plan or project charter document through the effective date of termination. This invoice will be due and payable upon receipt. Any prices quoted in this Agreement (or SOWs) shall only be binding for a term of three (3) months unless otherwise agreed to in writing by the parties. MDS reserves the right to renegotiate prices for scope changes, new or additional work beyond the scope, or if three (3) months has passed between the negotiation of the prices and the commencement of work."
  },
  {
    "contract_type": "Service Agreement",
    "clause_heading": "Independent Parties",
    "contract_id": "0bba9359-b70c-48b0-ab96-d0369d214ab5",
    "clause_id": "17",
    "clause": "Independent Parties, MDS shall be an independent contractor of Customer and shall have the right to control and direct the manner and/or means of its performance and delivery of Services and Products under this Agreement. This Agreement shall not be construed so as to create any partnership, joint venture, employer-employee, principal-agent or other relationship between the parties hereto other than an independent contractor relationship. Neither party shall be liable for the collection of any governmental taxes, duties or levies for the other party’s employees. The terms and conditions in this Agreement supersede all prior agreements (written or verbal) between the parties. If the terms of this Agreement conflict with the terms of other documents, then the terms of this Agreement will take precedence, except for those terms in Statements of Work. The parties may agree to different terms on a project-by-project basis by signing a Statement of Work that has conflicting terms. Only in that case will conflicting terms take precedence over those found in this Agreement. Customer’s acknowledgement, payment to MDS, allowance of commencement of performance by MDS, or acceptance of deliverables under this Agreement or related SOWs constitutes Customer’s unqualiﬁed acceptance of this Agreement and the terms of any related SOWs or COs. Obligations of conﬁdentiality, intellectual property rights and non-solicitation shall survive termination of this Agreement. This Agreement, consisting of these terms and conditions, the terms and conditions in any SOWs, or COs, incorporated herein by this by reference, constitute the entire agreement of the parties on the subject matter of this Agreement and supersedes all prior agreements and understandings. Any amendment to this Agreement will be in writing and must be signed by both parties."
  }
]